[
  {
    "title": "Mutton Biryani",
    "image": "https://i.ibb.co/y6wQphZ/1606114914-Hyderabadi-Mutton.jpg",
    "details": "Although made famous in various parts of the country, each marked with unique cooking techniques and spices; one should also try this taste in this part of the country. Filled with the rich aroma of spices and ghee, the mutton biryani is simply heaven. Juicy, tender pieces of mutton, fried with the biryani on a Tava, this y mmy recipe is a must-try.",
    "description": "Despite the staggering number of spices used this is a light and fragrant biryani. Like its famous counterparts from Delhi, Lucknow, and Hyderabad, Kolkata has its own unique biryani, which is much more moist and can be eaten by itself without any accompaniments like raitha or gravy. Potatoes are usually served with this biryani.Green cardamom, black cardamom, cloves, cinnamon, nutmeg, mace, fennel, cumin, white, and black peppers are some of the spices used in this recipe. Initially starting in a few handpicked restaurants, today it can be found along the length and breadth of the city. The use of potatoes is a unique feature that is not common in other traditional biryanis.",
    "price": 299,
    "rating": {
      "rate": 4.1,
      "count": 170
    }
  },
  {
    "title": "Morog Polao",
    "image": "https://i.ibb.co/dJyZ569/chicken-pulao.jpg",
    "details": "Morog Polao, a flavorful Bengali dish, combines tender chicken pieces marinated in aromatic spices with fragrant Basmati rice. The dish is cooked with ghee and a medley of spices, creating a savory and aromatic one-pot meal. Morog Polao is traditionally served during special occasions and celebrations, showcasing the rich and grand flavors of Bengali cuisine.",
    "description": "Morog Polao, a cherished masterpiece of Bengali cuisine, weaves together the heartiness of succulent chicken with the fragrance of Basmati rice and an ensemble of aromatic spices. The chicken is first marinated in a tapestry of ginger, garlic, red chili, and garam masala, rendering it tender and richly flavored. In a pot, ghee imparts its golden glow to a symphony of whole spices, creating an enticing aroma. The seared chicken is then joined by the soaked rice and fried onions, gradually building layers of taste and texture. As the dish gently simmers, fragrant herbs like mint and coriander add their flourish to the final ensemble. Morog Polao emerges as a splendid main course, bursting with savory and aromatic notes, gracing festive gatherings and special occasions with its sumptuous grandeur—a delightful representation of the culinary excellence inherent to Bengali cuisine.",
    "price": 120,
    "rating": {
      "rate": 4.4,
      "count": 259
    }
  },
  {
    "title": "Chingri Pulao - Prawn Pilaf",
    "image": "https://i.ibb.co/PNxZ2b5/Prawns-Pulao-2182.jpg",
    "details": "A specialty reserved for “Noboborsho” or Bengali New Year, this is a simple yet ﬂavorful dish and an attractive way to serve your guests a delectable rice preparation. It is something different from the traditional biryani. It can be prepared in one pot and is a quick ﬁx in a tight situation.Fennel, cumin, cardamom, cinnamon, mace, and nutmeg are some of the common spices used in this dish, with whole spices preferred over ground powders. Large to medium-sized prawns are cooked with the spices and the rice is added and steamed together.",
    "description": "Chingri Pulao is another simple yet flavorful meal with a twist on the conventional biryani. It is one of those enticing recipes that looks, smells, and tastes like you have spent hours in the kitchen! Yet, in reality, it involves minimal effort!The aromatic gobindobhog rice and Bengal prawns create such beautiful harmony. Also, there is incomparable sweetness from coconut, pungent flavor from spices, and a satisfying crunch from toasted coconut shavings. The recipe has everything a festive meal requires. So, if you haven't decided what to make for celebratory occasions like the Pujas, Chingri Pulao is a must-try!",
    "price": 259,
    "rating": {
      "rate": 4.7,
      "count": 359
    }
  },
  {
    "title": "Lau Ghonto - Bottle Gourd Curry",
    "image": "https://i.ibb.co/23q5V9x/Ilish-macher-matha-diye-lau-ghonto-1.jpg",
    "details": "Lau is bottle gourd, which is cooked with Udad Dal Boris and some light spices. Although the dish is not so spicy, it is good for the stomach and delicious too, so that is a bonus. Try this recipe if you want to rest your stomach after a hard day at work. Enjoy this Bengali food with rice.",
    "description": "A bowl of Lau Ghonto with plain rice and dal is more than enough for a comfort meal. It is pure happiness! If you have never tried this recipe before, I highly recommend you do it at least once. Lau Ghonto is a genuine and tasty Bengali delicacy made in practically every Bengali home. Although the recipe is not very hot, it is nutritious and aromatic, which is an extra advantage.The Bengali recipe for Lau Ghonto is straightforward. The dish’s complexity level is modest, making it acceptable for beginners. Plus, it is healthy for everyone, from children to the elderly, especially for people trying to lose weight.The bottle gourd used in this recipe is low in fat and cholesterol while high in dietary fiber, which is helpful against digestive issues.This terrific Asian vegetarian dish is ideal for a fast weekday supper! It is a must-try for even bottle gourd haters. Serving this Bengali dish over rice will surely relax your stomach after a long day at work!",
    "price": 249,
    "rating": {
      "rate": 3.9,
      "count": 159
    }
  },
  {
    "title": "Paneer Kathi Rolls - Paneer Frankie",
    "image": "https://i.ibb.co/859PB6k/Paneer-kathi-roll-1-B.jpg",
    "details": "Paneer Kathi Roll is a popular Indian street food consisting of spiced paneer (Indian cottage cheese) filling wrapped in a paratha (Indian flatbread) or roti. The paneer is marinated in yogurt and spices, mixed with onions and bell peppers, then wrapped in the bread. It's often garnished with onions, coriander, and chutneys. This dish is known for its spicy and savory flavors, making it a delicious and convenient snack or meal option.",
    "description": "Who doesn’t love Paneer Kathi Rolls? After all, they were the signature dish of Kolkata, the City of Joy! Initially, these rolls feature thin rotis wrapped around skewer-roasted beef kebabs. This easy and fast vegan variation brings everything to a new level. Paneer Kathi Rolls are popular street food in Bengal and other Indian regions. You can enjoy these exquisite treats at literally every fast-food restaurant, canteen, and even street kiosk. Regarding the fillings, there are countless options that you can try. Some rolls include mixed veggies, spicy Paneer, and sweet caramelized onions, while others feature potatoes, green peas, and capsicum. With only 30 minutes, you can get this incredibly easy-to-make meal done and enjoy a unique blend of spices and flavors. Wrap the rolls in parchment paper for a convenient on-the-go supper, or cut them in half to serve as an appetizer.",
    "price": 140,
    "rating": {
      "rate": 4.5,
      "count": 239
    }
  },
  {
    "title": "Shukto - Mixed Vegetable Stew",
    "image": "https://i.ibb.co/dGQVKJk/Shukto-Recipe-Bengali-Mixed-Vegetable-in-Mustard-and-Poppy-Seed-Gravy.jpg",
    "details": "“A wide array of mild, sometimes bitter, milky curries served for lunch to open up the palate for the oncoming spicier courses” is a generalized understanding of shukto. But to the Bengali palette, it’s a warm delectable medley of veggies cooked to tender perfection, mildly spiced, and a reminder of home wherever you are.Drumsticks, sweet potatoes, eggplant, flat beans, bitter gourd, green plantains, potatoes, and raw papaya are usually used for this recipe. Bay leaf and panch poran are the whole spices of choice. Freshly ground coconut milk is the base for the dish. Sundried lentil dumplings, dal’er bori, are also added.",
    "description": "Who said Bengalis are only interested in fish and curry? They know how to prepare and nail vegetable dishes as well. Shukto is one example.Made from bitter gourd, potatoes, plantains, and radishes, this mixed vegetable stew has a creamy, milky gravy that perfectly complements the gourd’s bitterness.According to Chitrita Banerjee’s book named “Bengali Cooking”, the term “shukto” originates from the Bengali word “shukuta”. It refers to the dried leaves of a bitter juice plant.Although many publications assert that Shukto is a Portuguese-influenced meal, food historians and specialists strenuously refute this statement. Old manuscripts revealed that Shukto appeared before the 16th century before the Portuguese came to India.This vegan recipe is a great way to start your meal when combined with ground spices and milk to form a thick curry. The final dish is a warm delectable medley of greens cooked to tender perfection with a taste of home wherever you are.",
    "price": 40,
    "rating": {
      "rate": 4.6,
      "count": 279
    }
  },
  {
    "title": "Chanar Dalna - Cottage Cheese And Potato Curry",
    "image": "https://i.ibb.co/Mp8Rb2s/chanar-dalna.jpg",
    "details": "Dhokar Dalna is another delightful Bengali vegan curry that utilizes fried chana dal cakes and cubed potatoes coated in a rich sauce of cumin seeds, bay leaf, ginger, and red chili paste.In India, the term “Dhokar” means treachery, which refers to the flesh-like texture of this recipe. Like Chanar Dalna, this outstanding vegan meal contains no garlic or onion. Although its preparation is quite challenging, this lentil cake is surprisingly flavorful and additive when enjoyed. Accompany it with Lucchi or steamed rice! If you follow my advice, you will undoubtedly love the dish!",
    "description": "In the past, whenever there was no fish or meat available, Bengali women would prepare Chanar Dalna as a substitute. In Bengali, “chanar” refers to cottage cheese, while “dalna” means curry.When combined, Chanar Dalna becomes a flavorful Niramish, meaning no onion and no garlic. Originally, people cooked this curry with Cottage Cheese. However, everything changed when Paneer entered the market.Premade Paneer has transformed Chanar Dalna into a much simpler and more convenient dish to make. Yet, regardless of your choice, both Paneer and Cottage Cheese render the dish perfectly.This recipe will be a nutritious, tasty, and simple addition to your regular menu. Its cooking difficulty level is so moderate that even a beginner can pull off the task.You can also add some fresh green peas for additional flavor and texture. Serve it with plain rice or flatbread, and you have a perfect meal for any Puja holiday.",
    "price": 50,
    "rating": {
      "rate": 4.2,
      "count": 249
    }
  },
  {
    "title": "Potoler Dolma - Stuffed Pointed Gourd",
    "image": "https://i.ibb.co/jGHXwpY/Potoler-Dolma-recipe-funloveandcooking-com.jpg",
    "details": "Potoler Dolma, also known as Parwal or Pointed Gourd Dolma, is a popular Bengali dish from India. It consists of pointed gourd (parwal) stuffed with a spiced mixture, typically made with ground meat (such as mutton or chicken), grated coconut, and a blend of aromatic spices. The stuffed gourds are then simmered in a flavorful gravy made from tomatoes, onions, and various spices. Potoler Dolma is known for its rich and complex flavors, and it's often served as a side dish or part of a festive Bengali meal. It's a delightful combination of tender gourds and a flavorful, aromatic stuffing.",
    "description": "In Bengali, “potol” refers to a pointed gourd (or parwal), while “dolma” means a stuffed vegetable. When combined, you will have a beautiful Bengali specialty called “Potoler Dolma”. Interestingly,this meal has an Armenian origin but made its way into the kitchens of Bengal’s nawabs (rulers) and changed dramatically. It is now part of every Bengali household menu. As a result, the Bengalis can proudly claim the dish as their own.Traditionally, this recipe often features prawns or fish as the stuffing. However, a low-calorie vegan twist with Indian cottage cheese and dried fruits are also widespread. The final dish is shallow fried and mixed in a tangy, spicy cashew nut sauce.",
    "price": 40,
    "rating": {
      "rate": 4.6,
      "count": 288
    }
  },
  {
    "title": "Rasgullas Syrup-Filled Rolls",
    "image": "https://i.ibb.co/gZ3Yyy8/rasogoola.jpg",
    "details": "Unlike Rasgullas, Sandesh is drier and not too sugary, enabling folks with a sweet craving to enjoy it comfortably. This delicacy comprises Khoya, a type of condensed milk, to infuse a unique flavor. In Hindi, the dish’s name means “news” or “messages”. Bengalis have a history of delivering sweets or food as gifts to their family and friends, which is how the sweet gained its name. Originated in the Bengal area since the 16th century, this simple treat, lightly spiced with cardamom, is perfect for the holiday season! You can keep it in the refrigerator for 1-2 days. Do not eat Sandesh if you have stored it longer than that.",
    "description": "It would be a crime not to satiate your sweet tooth when visiting Bengal. Rasgulla (or Cham Cham) is my top suggestion for you. These Bengali desserts will make even the most adverse to sweets salivate and want another decadent piece.Regarding the origin, these spongy white Rasgullas are thought to have been made by Nobin Chandra Das, a confectioner located in Kolkata, in 1868. Another idea holds that Nobin Chandra Das only popularized the already-existing dish.Traditionally, local Bengalis present Rasgullas to goddess Lakshmi to appease her fury for being mistreated. You will find these lovely treats served on the ninth day of Rath Yatra or the farmed Chariot Festival.The Bengalis make Rasgullas by curdling milk. Chenna (Indian cottage cheese) and whey are separated by draining in a cotton towel. Then, the drained chenna is kneaded before transforming into balls. They are fried in sugar syrup until light and spongy.These juicy little balls are addicting and tasty treats for your holidays. Making them is simple and takes a short amount of time. Even cooking newbies can give them a go! Garnish this sweet delicacy with scented cardamom or rosewater.Making Rasgulla balls is so simple and fun!",
    "price": 220,
    "rating": {
      "rate": 4.8,
      "count": 969
    }
  },
  {
    "title": "Mishti Doi",
    "image": "https://i.ibb.co/TH6y3VG/130182512-basundi-rabri-or-rabdi-is-a-dessert-made-of-condensed-milk-and-dry-fruits.jpg",
    "details": "SourceMishti Doi is a sweetened yoghurt dish that is served at the end of supper and serves as a sweet dish. Though served all around the country now, it was initially made famous by Bengal. Try it if you have a sweet tooth.",
    "description": "Thickened curd sweetened with sugar, Mishti Doi is a Bengali yogurt that local people enjoy as a dessert after dinner. If you are a fan of sweet recipes, there is a high chance you have encountered Mishti Doi in Bengal in your search for a lovely meal.Normally, the Bengalis prepare Mishti Doi with milk, curd, and sugar(or palm jaggery). You can purchase this brilliant treat at practically every confectionary store in the region.Prepare this well-known recipe for festivals or serve it after your regular meal. Either way, I guarantee that this dish will always delight your taste buds.",
    "price": 400,
    "rating": {
      "rate": 4.2,
      "count": 356
    }
  },
  {
    "title": "Patishapta - Coconut Crepes",
    "image": "https://i.ibb.co/fGmfXJ7/osjrt3e8-pithe-625x300-12-January-23.jpg",
    "details": "Another unique Bengali sweet, this is usually homemade with a batter of powdered rice and rolled with the preparation of coconut bits with sugar and khoya. One of the most amazing Bengali dishes, one has got to try this one, sweet tooth or not. I am sure you are going to love it.",
    "description": "If the authentic crepe originates from France, this coconut variation is a big hit in Bengal. Created from a batter of powdered rice and wrapped in a mixture of coconut chunks with sugar and khoya, Patishapta is a unique treat you must not miss. Making Patishapta is simple and takes around 30 minutes only. Thus, it is a perfect candidate for a Bengali breakfast recipe or a snack to offer unexpected visitors.This delicate, thin coconut crepe is a favorite of many Bengalis during winter. Its amazing sweetness will transform the cold season into delightful delicacies.",
    "price": 20,
    "rating": {
      "rate": 4.6,
      "count": 296
    }
  },
  {
    "title": "Lobongo Lotika - Syrup Dough",
    "image": "https://i.ibb.co/wwFvhmp/lobongo-lotika.jpg",
    "details": "Lobongo Lotika is a popular Bengali dessert featuring deep-fried pastries filled with a mixture of grated coconut, khoya (milk solids), sugar, and cardamom. These pastries are shaped into cylinders or rectangles and sealed with a clove. After frying, they are soaked in sugar syrup, resulting in a sweet, aromatic, and slightly chewy dessert. Lobongo Lotika is often enjoyed during Bengali festivals and special occasions.",
    "description": "It is no longer a secret that Bengalis have a sweet for every occasion. Lobongo Lotika is one such treat. The combination of maida, cardamom, raisins, cloves, and shredded coconut guarantees the most additive flavor your tastebuds will experience.Sealed with a clove, then deep-fried and dipped in sugar syrup, this kheer-based treat promises to be a flaky package that will satisfy even the pickiest eaters. It has a crispy texture on the surface and a luscious, creamy filling. Traditionally, the Lobongo Lotika recipe calls for a lengthy preparation to make the kheer filling. However, it is deceptively simple.The clove releases its essential oils and scent into the sweet during the cooking process, making it even more flavorful. Many people eat the clove at the end, but it is all right to throw it away as well. It is a matter of personal preference here.",
    "price": 60,
    "rating": {
      "rate": 4.1,
      "count": 159
    }
  },
  {
    "title": "Mangshor Jhol",
    "image": "https://i.ibb.co/Vw4LBVr/Kosha-Mangsho-Bengali-dish-Slow-cooked-aromatic-Mutton-gravy-2.jpg",
    "details": "Mangshor Jhol is a traditional Bengali Mutton Curry made with tender mutton pieces cooked in a spicy and aromatic gravy. It's a beloved dish in Bengali cuisine, often served with steamed rice. The curry features spices like cumin, coriander, turmeric, and chili peppers, creating a rich and flavorful dish enjoyed on special occasions and as a comforting meal.",
    "description": "Sunday afternoons are synonymous with Mutton Curry and Rice in any quintessential middle-class Bengali household. The taste of tender mutton in a rich gravy accompanied with hot steamy rice is a match made in heaven.Mangsho generally refers to chicken or mutton and is usually used quite interchangeably. Mangshor Jhol basically refers to a traditional mutton curry made in the Bengali style. Jhol refers to a traditionally thin gravy but it changes from household to household. It is usually mildly spiced to ensure the freshness of the meat is retained.The natural gelatin from the bones imparts a silky smooth feel to the gravy. Fat from the mutton once cooked forms the rogan, which rises to the top and forms what appears to be a thick layer of oil.",
    "price": 300,
    "rating": {
      "rate": 4.4,
      "count": 249
    }
  },
  {
    "title": "Macher Jhol (Bengali Fish Curry)",
    "image": "https://i.ibb.co/3yFMtj9/Aar-macher-Jhol.jpg",
    "details": "One of the much-favoured fishes in the region, Hilsa or ilish fish curry is something that you have got to try your hands on. The pungent smelling curry prepared with Nigella seeds and chilli to give it the required balance that makes it so perfect. You have got to try this one as it one of the staple food of West Bengal.",
    "description": "Bengal and especially Kolkatta, being situated on one of the largest delta basins and mangrove coasts in the world, enjoys a bountiful supply of seafood, freshwater, and seawater fish. But there is one fish that is especially close to the heart of every Bengali: the infamous Hilsa or Ilish.It is a fish similar in nature to the salmon which swims upriver from the coast. The fish has a lot of tiny pin bones, but is soft flaky and very tasty when fried or prepared in a gravy. This is a traditional spicy gravy due to the presence of green chilies and mustard.It is usually seasoned with the “panch poran” or 5 spice mix traditional to the region, it usually contains cumin, brown mustard, fenugreek, nigella, and fennel. The fillets of fish are first fried before being added into a rich and spicy gravy or jhol.",
    "price": 259,
    "rating": {
      "rate": 4.1,
      "count": 458
    }
  },
  {
    "title": "Lau Patai Pabda Paturi (Steamed Pabda Fish in Bottled Gourd Leaf)",
    "image": "https://i.ibb.co/J57HjBt/steamed-pabda-fish-in-bottle-gourd-leaf-lau-patai-pabda-paturi-recipe-main-photo.jpg",
    "details": "Lau Patai Pabda Paturi is a traditional Bengali fish dish featuring Pabda fish marinated with mustard paste, poppy seeds, coconut, and spices. The fish is wrapped in bottle gourd leaves and cooked using the 'Paturi' technique, infusing it with spicy, nutty, and earthy flavors. It's a classic Bengali delicacy served with steamed rice.",
    "description": "Pabda refers to the Indian catfish that is found in abundance across the Mangroves of the Sunderbans. It is not an extremely bony fish, having one main bone running through the length of the body. Pabda Macher Kalo Jeerer Jhol is cooked light with minimal spices.Surprisingly Pabda Tel Jhaal requires no onion, no garlic and no tomato at all! The bata moshla/masala (freshly pounded spices) and fresh coriander leaves are the key to this wonderfully fresh and light recipe. Bottled gourd leaves are used to wrap the fish once they are marinated and can be steamed either in a pan or a hollow vessel on low heat.The flavors of fresh coriander mustard and chilies are an absolutely mouth-watering combination. This dish is best served with rotis or parathas.",
    "price": 80,
    "rating": {
      "rate": 4.7,
      "count": 409
    }
  },
  {
    "title": "Aloo Posto",
    "image": "https://i.ibb.co/x3tjn9z/ALOO-POSTO.jpg",
    "details": "Aloo Posto is a classic Bengali dish featuring potatoes (aloo) cooked in a creamy poppy seed paste (posto) sauce. It has a rich, nutty, and slightly sweet flavor with spiciness from mustard oil and green chilies. Aloo Posto is commonly served with steamed rice and is a beloved comfort food in Bengali cuisine.",
    "description": "This is a traditional Bengali dish prepared using potatoes lightly spiced with poppy seed paste. It is a common comfort food eaten with rice and dhal. This recipe can be made with or without onions and garlic and is light on the palette. Fresh poppy seeds are a key element to this dish and one must ensure to use the freshest possible seeds; using rancid seeds can lead to a sharp bitter flavor in the overall dish.The three essential ingredients apart from potatoes, which cannot be substituted, are nigella seeds (kalonji), mustard oil, and poppy seeds.",
    "price": 30,
    "rating": {
      "rate": 4.4,
      "count": 256
    }
  },
  {
    "title": "Macher Matha Diye Moog Dal",
    "image": "https://i.ibb.co/xSzk5dh/Machar-Matha-dia-mug-dal.jpg",
    "details": "Macher Matha Diye Moog Dal is a traditional Bengali dish made with moong dal (yellow mung beans) and fish heads (usually from varieties like Rohu or Katla). The dish is flavored with spices like mustard seeds, cumin seeds, green chilies, and ginger. It has a savory and slightly spicy flavor and is typically served with steamed rice, representing the rich culinary heritage of Bengali cuisine.",
    "description": "An unlikely combination of lentils and fried fish head, this is a delicacy reserved for a traditional Bengali table. The flavor of fresh carp head fried and infused with roasted moong dal is an absolute treat for the senses. There is no other dal in Bengali cuisine that occupies a higher position than this dish.It is the perfect dal to serve at wedding lunches, first rice ceremonies, and the like. The Bengali favorite is the head of a large freshwater fish called the katla - a kind of carp that lives in freshwater. It is served with bhajas (fried dishes) such as beguni or jhuri alu bhajas.",
    "price": 599,
    "rating": {
      "rate": 4.8,
      "count": 859
    }
  },
  {
    "title": "Shorshe Ilish",
    "image": "https://i.ibb.co/sbJ9bjL/Shorsha-Ilish2.jpg",
    "details": "Also known as Ilish Bhapa, this essential but savory meal from the marshes of Bengal combines two favorites of the region: Hilsa fish (King of fish in Southeast Asia) and mustard seeds. It is a traditional Bengali fish meal that goes well with rice or Khichdi.",
    "description": "A popular dish from the wetlands of Bengal, stretching across borders between India and Bangladesh, this humble yet flavorful dish unites two favorites of the region: hilsa or Tenualosa ilisha, a type of herring found in the rivers and tributaries that span the region, and mustard seeds.The dish is popular among the people of Bangladesh, where the fish is mainly found, and in the neighboring Indian states of West Bengal, Tripura, and Assam's Barak valley. Hilsa, white mustard, mustard oil, green chili, black cumin, turmeric powder, red chili powder, and salt are the main ingredients. Lime juice and/or coriander leaves may also be added for flavor.",
    "price": 499,
    "rating": {
      "rate": 4.7,
      "count": 689
    }
  },
  {
    "title": "Ilish Paturi (Hilsa Cooked in Banana Leaf)",
    "image": "https://i.ibb.co/PTnnzQm/2018-03-19-11-45-19.jpg",
    "details": "Ilish Paturi is a celebrated Bengali dish made with Hilsa fish. The fish is marinated in a blend of mustard paste, green chilies, grated coconut, turmeric, and mustard oil. It's then wrapped in a banana leaf and either steamed or roasted, creating a unique flavor profile of pungent mustard, spiciness from chilies, creaminess from coconut, and the richness of Hilsa fish. This dish is commonly served with steamed rice and showcases the culinary artistry of Bengal.",
    "description": "Ilish Macher Paturi combines three of Bengal's greatest loves - the Hilsa fish, the banana plant, and mustard. Even though it looks very polished, it is a fairly easy recipe to execute. It requires very few ingredients, no special technique, and can be cooked very quickly.This simple recipe calls for a smooth marinade of mustard seeds, ginger, and turmeric, which is blended with mustard oil and beaten yogurt. The fish is then coated with this marinade and wrapped in banana leaves and then cooked over a hot griddle with a little bit of oil. A visually appetizing masterpiece for any dinner table. Best served with basmati rice.",
    "price": 399,
    "rating": {
      "rate": 4.5,
      "count": 459
    }
  },
  {
    "title": "Aam Tel Ilish (Mango-flavored Hilsa Steamed in Pumpkin Leaf)",
    "image": "https://i.ibb.co/n6zY6PW/kancha-aam-die-ilish-recipe.jpg",
    "details": "“Aam Tel Ilish which is mango pickle-flavored, steamed boneless Hilsa wrapped in a pumpkin leaf and served in a clay pot with steamed rice” - a favorite at Oh Calcutta, Bengaluru's best Bengali restaurant. Mustard fresh ginger and tangy mango pickle are ground into a smooth paste. The fish is then fried and tempered in this puree along with copious amounts of mustard oil.",
    "description": "Aam Tel Ilish is a quintessential Bengali delicacy renowned for its exquisite flavor profile. This dish features tender Hilsa fish (Ilish) immersed in a luscious sauce crafted from raw green mangoes, mustard seeds, and mustard oil. The process involves marinating the fish in turmeric and salt before gently simmering it in the aromatic mango-mustard concoction. The result is a delightful harmony of tastes—the tartness of the green mangoes perfectly complements the pungency of the mustard seeds, while green chilies provide a subtle heat. A touch of sugar balances these flavors, creating a mouthwatering symphony. Aam Tel Ilish is traditionally served hot with steamed rice, offering a sensory journey into the heart of Bengali cuisine and its ingenious use of ingredients to create an unforgettable dining experience.",
    "price": 399,
    "rating": {
      "rate": 4.2,
      "count": 248
    }
  },
  {
    "title": "Macher Chop (Bengali Fish Croquette)",
    "image": "https://i.ibb.co/N919vK4/Macher-Chop-Fish-Croquettes-Fish-Chop-Spicy-World-Simple-and-Easy-Recipes-by-Arpita.jpg",
    "details": "Macher Chop is basically croquettes stuffed with fish and potatoes, dancing with mustard sauce, and served over tea. It is a widespread snack choice among local Bengalis, thanks to its simple preparation and scrumptious flavor.Besides snacking, Macher Chop is also an ideal appetizer or part of the festive lunch plate. You will fall in love with this recipe right away after feeling its brilliant texture: soft and tasty on the inside, with a crispy breaded covering on the outside.Traditionally, people add raisins to enhance the dish's sweetness. Try preparing these croquettes for your Sunday afternoon snacks, just like how local Bengalis do it!",
    "description": "Macher Chop is a delightful and cherished snack from Bengali cuisine, known for its exquisite blend of flavors and textures. At its core are minced fish, typically varieties like Rohu or Katla, skillfully combined with mashed potatoes, finely chopped onions, ginger, garlic, green chilies, and a medley of spices like turmeric, cumin, and garam masala. This flavorful mixture is expertly shaped into small oval or round patties before being coated with a golden, crispy layer of beaten eggs and breadcrumbs. The croquettes are then deep-fried to perfection, resulting in a tantalizing snack that boasts the unique taste of fish, an aromatic touch from ginger and garlic, and a delightful spiciness. Macher Chop is best enjoyed piping hot, accompanied by zesty mustard sauce or a tangy chutney, making it a beloved snack that embodies the culinary creativity and love for fish that characterizes Bengali cuisine.",
    "price": 30,
    "rating": {
      "rate": 4.7,
      "count": 249
    }
  },
  {
    "title": "Gondhoraj Maach (Fish with Kafir Lime)",
    "image": "https://i.ibb.co/hXvYjWg/Gondhoraj-Bhetki.jpg",
    "details": "Gondhoraj Ibeu, locally called the Rangpur lime, is a variety of lime indigenous to Bengal. It is surprising how understated it is, given its culinary prowess. Just a few drops are enough to elevate the most humble and insipid dishes into divine delectable masterpieces. The canton lime from China, hime from Japan, and the famous key lime from the Florida Keys and Caribbean would be close competitors of the wonderful olfactory experience this provides.The barramundi or Asian sea bass is the preferred fish here, for its boneless and soft texture, paired with a mild sauce flavored with cream, yogurt, and a ginger-chili-garlic paste. The icing on the cake of course being the Godhoraj lime juice and zest to finish it off.",
    "description": "Gondhoraj Maach is an exquisite Bengali fish curry that tantalizes the senses with its unique aroma and flavors. At its core, it features tender pieces of fish, often the prized Hilsa or Bhetki, that are gently marinated in a blend of turmeric and salt, imparting a vibrant color and tenderness. The true star of this dish, however, is the Gondhoraj lime, renowned for its intensely fragrant and zesty scent. The lime's juice and zest infuse the curry, adding an unparalleled citrusy aroma and a refreshing tanginess. The preparation includes a mustard and green chili paste, contributing a delightful pungency, and the curry is simmered to perfection in mustard oil, with the addition of aromatic spices like cumin and coriander. Gondhoraj Maach is a culinary masterpiece, traditionally served with steamed rice, showcasing the ingenuity of Bengali cuisine in using local ingredients to create an unforgettable dining experience that is both fragrant and flavorful.",
    "price": 259,
    "rating": {
      "rate": 4.6,
      "count": 289
    }
  },
  {
    "title": "Bengali Mishti Pulao (Cashew & Raisin Pilaf)",
    "image": "https://i.ibb.co/Fq6hhxN/Bengali-Mishti-Pulao-with-Vegetables.jpg",
    "details": "Bengal is famous for its variety of sweets made with milk, milk fudge, and cheese. Just as famous as the sweet Misthi Pulao, Basmati is the choice of rice. The pulao is flavored with green cardamom, bay leaf, and cloves. The addition of ghee or clarified butter transforms the dish from a mundane rice preparation into an ornate addition to your dining table.Finally, a little sugar, roasted cashew nuts, and raisins are added before it is steamed to perfection. Best served with a spicy curry or meat, this dish with its light flavors and richness is ideal for cutting through the sharpness of a spicy hearty meat dish.",
    "description": "Bengali Mishti Pulao is a cherished and aromatic rice dish that embodies the essence of Bengali culinary artistry. At its heart lies fragrant Basmati rice, simmered to fluffy perfection, while whole spices like cinnamon, cardamom, cloves, and bay leaves dance in aromatic ghee, releasing their warm flavors. What sets this pulao apart is its enchanting touch of sweetness. Sugar or jaggery, lovingly caramelized, adds a delicate and inviting sweetness that harmonizes exquisitely with the spices. Alongside the rice, a medley of dried fruits and nuts, like cashews, raisins, and almonds, contributes layers of textures and tastes. Bengali Mishti Pulao is a quintessential part of celebratory feasts, from weddings to festivals, where it plays a starring role on the plate, offering a sensory journey into the heart of Bengal's culinary heritage—a symphony of flavors that is both comforting and indulgent.",
    "price": 149,
    "rating": {
      "rate": 4.5,
      "count": 287
    }
  },
  {
    "title": "Kosha Mangsho (Bengali Mutton Curry)",
    "image": "https://i.ibb.co/zGSJRhX/Bengali-Kosha-Mangsho.jpg",
    "details": "This is traditional mutton gravy prepared using a base of onions and potatoes seasoned with black pepper, cinnamon stick, bay leaves, cloves, and cardamom. Boneless chunks of lamb or mutton are sautéed in mustard oil until tender and then added to the curry base.Sugar is added to the curry to finish it off, giving it a deep red color and a flavor profile that is rich deep and intense. Best served with rice or porota.",
    "description": "Kosha Mangsho, the pride of Bengali cuisine, is a sumptuous mutton curry that epitomizes the essence of rich and flavorful comfort food. At its heart is succulent mutton, meticulously marinated in yogurt and a harmonious blend of spices, from fiery red chili powder to the earthiness of cumin and coriander. This marinated meat takes center stage in a slow, magical alchemy that unfolds in a heavy-bottomed pan. Slices of onions, gracefully sautéed to a glorious golden hue, join the stage, giving depth to the curry. As the mutton simmers, the onions meld with the spices, infusing the dish with a complexity of flavors that dance on the palate. It's the slow, patient cooking, giving rise to the caramelized, darkened edges of the meat, that imparts the name 'Kosha', signifying this culinary artistry. The result is a heady and spicy symphony, where every bite is a melange of textures and tastes—a rich, tender mutton with a gravy that embodies the soul of Bengal, traditionally served with rice or luchi, making it a centerpiece of festive feasts and cherished family gatherings.",
    "price": 300,
    "rating": {
      "rate": 4.9,
      "count": 489
    }
  },
  {
    "title": "Chingri Malai Curry (Prawn Curry)",
    "image": "https://i.ibb.co/K6F8dNg/chingri-malai-curry-add.jpg",
    "details": "This is tiger/king prawns steeped in a creamy rich and lightly flavored sauce and coconut milk. It is a dish served during celebrations and festivals and was a favorite of the British in India.Mustard oil, onions, turmeric powder, chopped green chili, garlic paste, and ginger paste make up the body of the dish, giving it a refreshing flavor. Best served with steamed white rice.",
    "description": "With Chingri Malai Curry, you get to taste river prawns sautéed in fiery spices before being drenched in the creamy richness of coconut milk. In fact, Chingri means river prawns themselves.This immortal Bengali curry dispels the prevalent misconception that coconut milk is only for South Indian recipes. Coconut milk does a brilliant job here in rendering the richness for the prawns and the curry as a whole.    Nobody doubts the tasty flavor of this Bengali curry. However, there are several theories about its origin. While some people believe this dish originated in Malaysia as this country has a similar delicacy, others assert it was created in the Indian subcontinent.",
    "price": 299,
    "rating": {
      "rate": 4.7,
      "count": 452
    }
  },
  {
    "title": "Begun Bhaja (Brinjal Fry)",
    "image": "https://i.ibb.co/PMZRYGt/begun-basonti.jpg",
    "details": "A simple yet spicy marinade of chili powder, turmeric, and lime seasoned with salt and pan-fried with mustard oil. Baja refers to frying and can be a variety of vegetables or meat fried.Eggplant, or aubergine, is a favorite among Bengalis. Coat the eggplant with rice flour to get a crispy outside and moist inside. Potatoes, pumpkin, bitter gourd, onions, and green plantains can be used in place of eggplant. Usually served as an appetizer, this dish is a quick and easy way to satisfy hungry bellies any time of the day.",
    "description": "Begun Bhaja is a delightful Bengali dish that transforms humble eggplants into a crispy and flavorful masterpiece. Slender slices of eggplant, marinated with a mixture of turmeric and salt, undergo a remarkable metamorphosis as they meet the sizzling embrace of mustard oil in a pan. The result is golden-brown, delicate rounds that are at once crispy on the outside and melt-in-the-mouth tender on the inside. The seasoning adds a subtle warmth, while the mustard oil lends its unique, earthy character, making every bite a burst of flavor and texture. Begun Bhaja is not only a beloved side dish in Bengali meals but also a timeless snack, served with chutney or yogurt. This dish embodies the essence of Bengali cuisine—simple ingredients, expertly prepared to create a dish that's humble yet extraordinary, and a testament to the culinary artistry that thrives in the heart of Bengal.",
    "price": 10,
    "rating": {
      "rate": 4.7,
      "count": 559
    }
  },
  {
    "title": "Dhokar Dalna (Lentil Cake Curry)",
    "image": "https://i.ibb.co/WpP6WFv/Dhokar-Dalna-Lentil-Cake-Curry.jpg",
    "details": "Dhokar Dalna is another delightful Bengali vegan curry that utilizes fried chana dal cakes and cubed potatoes coated in a rich sauce of cumin seeds, bay leaf, ginger, and red chili paste.In India, the term “Dhokar” means treachery, which refers to the flesh-like texture of this recipe. Like Chanar Dalna, this outstanding vegan meal contains no garlic or onion.    Although its preparation is quite challenging, this lentil cake is surprisingly flavorful and additive when enjoyed. Accompany it with Lucchi or steamed rice! If you follow my advice, you will undoubtedly love the dish!",
    "description": "Dhokar refers to split chickpeas that are ground and formed into cakes and steeped in a thick curry with cubed potatoes, cumin seeds, hing, and bay leaf along with ginger and red chili paste.This is a star among the veggie dishes that make up traditional Bengali cuisine and is reserved usually for special occasions like religious festivals and days of abstinence, when meat or fish isn't consumed. It is best served with steamed white rice.The name is derived from the word dhoka, which means betrayal, referring to the meat-like consistency and texture of the chickpea cakes, something along the lines of mock meat. The base of the gravy is usually made with satvik ingredients. Satvik refers to the omission of onions and garlic and it is a cuisine that is popular within the Jain community in India and also followed by certain Hindu castes.",
    "price": 30,
    "rating": {
      "rate": 4.5,
      "count": 359
    }
  },
  {
    "title": "Postor Bora",
    "image": "https://i.ibb.co/GTk7pgW/Posto-bora.jpg",
    "details": "Postor Bora is a classic Bengali snack made from ground poppy seeds mixed with spices, formed into fritters, and deep-fried until crispy. These fritters have a unique nutty flavor from the poppy seeds and are typically spiced with green chilies and ginger. Postor Bora is enjoyed as a snack or side dish in Bengali cuisine, often served with rice and various curries.",
    "description": "Postor bora is a mix of poppy seed paste, grated coconut, onions, green chilies, and rice flour, which are shallow fried as fritters in mustard oil. It is an absolute delicacy for Bengalis and is known for its extraordinary flavor and texture. It is the perfect fritter, with the outer crisp containing of poppy seeds and a tender center.It is mostly served as a starter or as a side with the main course to relish. Posto bora is a very simple and easy recipe and requires very minimal and easily available ingredients.The best part of the recipe is that it requires very little oil, unlike other bora (pakoda). It can be prepared very easily without too much time and you it can be prepared in batches. So it is a great option for any get-together and small party.",
    "price": 10,
    "rating": {
      "rate": 4.1,
      "count": 268
    }
  },
  {
    "title": "Jhal Muri - Puffed Rice",
    "image": "https://i.ibb.co/Kjkv0Bt/Jhal-Muri-2-3.jpg",
    "details": "Jhal Muri is a popular street food snack from West Bengal, India, and Bangladesh. It's made with puffed rice mixed with chopped onions, tomatoes, green chilies, crunchy elements like peanuts and sev, and a variety of spices. Mustard oil is often used for a distinctive flavor. Jhal Muri is known for its spicy, tangy, and crunchy profile, making it a beloved on-the-go snack enjoyed by people of all ages in the region.",
    "description": "In the language of Indian street cuisine, Jhal means a spicy dish, while Muri is puffed rice. Altogether, Jhal Muri is a spicy puffed rice dish, another excellent snack to have when strolling about the city in the evening and having long-winded chats with a buddy.You will enjoy rice flakes having been mixed with spicy chutney and mustard oil, as well as roasted lentils and coconut pieces. The finest site to try this recipe is Dacre Lane in Kolkata, which many locals and tourists agree as having the best street food!The most remarkable thing about Jhal Muri is that it comes together in only 15 minutes. Super handy, right? Remember to serve the dish shortly after it is made, or the puffed rice will soften. Accompanying it with crispy onion pakoda is also a good idea.You may prepare this simple Jhal Muri recipe for special events such as picnics, road vacations, potlucks, and even family gatherings. This scrumptious recipe can also curb your midnight hunger pangs.",
    "price": 10,
    "rating": {
      "rate": 4.8,
      "count": 959
    }
  },
  {
    "title": "Khichuri - Bengali Rice And Lentils",
    "image": "https://i.ibb.co/P469Gcx/vegetable-khichdi-end.jpg",
    "details": "Khichuri, also known as Bengali Rice and Lentils, is a comforting dish made from rice, yellow moong dal (lentils), vegetables, and spices. It's typically cooked in ghee for added richness. The dish has a mild and soothing flavor with a subtle spiciness from the spices. Khichuri is enjoyed as a complete meal and is often served during festivals and rainy days, providing both nourishment and comfort in Bengali cuisine.",
    "description": "Did you know that Khichuri is one of the oldest and most relished dishes in India? It is also one of the first solid meals that infants consume in various Indian homes.A dish of hot khichuri is the first thing popping up in many people's minds after a fatigued working day. Or, if you are just in the mood for something nourishing, khichuri is a must-have.Let's try this Bengali-style Khichuri for your next supper! It is super comforting, simple, and irresistibly tasty. Cooked with roasted moong dal and aromatic gobindobhog rice, Khichuri is just a porridge of rice and dal seasoned with a handful of spices.If there is one common dish that connects the diverse and multifaceted South Asian cuisines, it is Khichuri. This rare recipe effortlessly bridges the gap between “common” and “special” in terms of preparation.    You can also throw a mixture of vegetables into this rice and lentil dish to transform the dish into a filling one-pot yumminess. However, veggies are entirely optional. Feel free to omit them if you don't like greens.Accompany your Khichuri with a cup of yogurt and some roasted papads on the side! Also, put a dollop of melted ghee on top to elevate the meal to a whole new level.",
    "price": 259,
    "rating": {
      "rate": 4.7,
      "count": 459
    }
  }
]
